Core/src/src/Documents/ПлатежнаяВедомость/ПлатежнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежнаяВедомость</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПлатежнаяВедомость</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyДокументОснование</name>
    <type>
      <types>DocumentRef.НачислениеЗарплаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДФЛРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторВИнтернетБанке</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПФПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛгот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/CommonForms/ПодборПоВедомости/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Параметры.Свойство("ДатаДокумента",ДатаДокумента);
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	Параметры.Свойство("Организация",Организация);
	Параметры.Свойство("Подразделение",Подразделение);
	Параметры.Свойство("Сотрудник",Сотрудник);
	
	МассивВедомостей = Новый Массив();
	Если Параметры.Свойство("МассивВедомостей",МассивВедомостей) Тогда
		СписокВедомостей.ЗагрузитьЗначения(МассивВедомостей);
	КонецЕсли;
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	УчетПоПроектам = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	ЗаполнитьДанныеФормы();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДанныеФормы()
	Если СписокВедомостей.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	ПлатежнаяВедомостьСотрудники.Ссылка КАК Ведомость,
		|	ПлатежнаяВедомостьСотрудники.Сотрудник,
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
		|	Выбор 
		|		Когда &УчетПоПроектам
		|			Тогда ПлатежнаяВедомостьСотрудники.Проект
		|		Иначе Значение(Справочник.Проекты.БезПроекта)
		|	Конец КАК Проект,
		//ПодольскийАИ #УчетПроектов 25.11.2020 }
		|	ПлатежнаяВедомостьСотрудники.СуммаПлатежа,
		|	ПлатежнаяВедомостьСотрудники.НДФЛПлатежа,
		//Паганини ПФ_
	    //|	РасчетыСПерсоналомОстатки.СуммаОстаток
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияНДФЛ,
		|	ПлатежнаяВедомостьСотрудники.ВидУдержанияПФ,
		|	ПлатежнаяВедомостьСотрудники.СуммаПФПлатежа,
		|	ЕСТЬNULL(РасчетыСПерсоналомОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		//_Паганини ПФ
		|,	ПлатежнаяВедомостьСотрудники.СуммаЛгот КАК СуммаЛьгот //+++ Дмгг
		|ИЗ
		|	Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПерсоналом.Остатки(&ДатаДокумента, ) КАК РасчетыСПерсоналомОстатки
		|		ПО ПлатежнаяВедомостьСотрудники.Ссылка.Организация = РасчетыСПерсоналомОстатки.Организация
		|			И ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница = РасчетыСПерсоналомОстатки.СтруктурнаяЕдиница
		|			И ПлатежнаяВедомостьСотрудники.Сотрудник = РасчетыСПерсоналомОстатки.Сотрудник
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
		|			И Выбор 
		|				Когда &УчетПоПроектам
		|					Тогда ПлатежнаяВедомостьСотрудники.Проект = РасчетыСПерсоналомОстатки.Проект
		|				Иначе Истина
		|			Конец
		//ПодольскийАИ #УчетПроектов 25.11.2020 }
		|ГДЕ
		|	ПлатежнаяВедомостьСотрудники.Ссылка В(&СписокВедомостей)";
	Если ЗначениеЗаполнено(Организация) Тогда
		ЗапросТекст = ЗапросТекст+"
		|	И ПлатежнаяВедомостьСотрудники.Ссылка.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ЗапросТекст = ЗапросТекст+"
		|	И ПлатежнаяВедомостьСотрудники.Ссылка.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Подразделение);
	КонецЕсли;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ЗапросТекст = ЗапросТекст+"
		|	И ПлатежнаяВедомостьСотрудники.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("СписокВедомостей", СписокВедомостей);
	
	//ПодольскийАИ #УчетПроектов 25.11.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 25.11.2020 }
	
	Запрос.Текст = ЗапросТекст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТеСумма = МИН(ВыборкаДетальныеЗаписи.СуммаПлатежа,ВыборкаДетальныеЗаписи.СуммаОстаток);
		Если ТеСумма>0 Тогда
			Коэффициент = ТеСумма/ВыборкаДетальныеЗаписи.СуммаПлатежа;//Паганини
			СтрСотрудникиИзВедомость = СотрудникиИзВедомость.Добавить();
			ЗаполнитьЗначенияСвойств(СтрСотрудникиИзВедомость,ВыборкаДетальныеЗаписи);
			СтрСотрудникиИзВедомость.СуммаПлатежа = ТеСумма;
			СтрСотрудникиИзВедомость.НДФЛПлатежа = ВыборкаДетальныеЗаписи.НДФЛПлатежа * ТеСумма / ВыборкаДетальныеЗаписи.СуммаПлатежа;
			СтрСотрудникиИзВедомость.Сумма = ВыборкаДетальныеЗаписи.СуммаПлатежа;
			СтрСотрудникиИзВедомость.НДФЛ = ВыборкаДетальныеЗаписи.НДФЛПлатежа;
			//Паганини ПФ_
			СтрСотрудникиИзВедомость.СуммаПФПлатежа = ВыборкаДетальныеЗаписи.СуммаПФПлатежа * Коэффициент;
			СтрСотрудникиИзВедомость.ПФ				= ВыборкаДетальныеЗаписи.СуммаПФПлатежа;
			//_Паганини ПФ	
			СтрСотрудникиИзВедомость.СуммаЛьгот		= ВыборкаДетальныеЗаписи.СуммаЛьгот; //+++ Дмгг
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПлатежиВыполнить()
	Для Каждого СтрокаТаблицы Из СотрудникиИзВедомость Цикл
		СтрокаТаблицы.Выбран = Истина;
	КонецЦикла;		
КонецПроцедуры


&НаКлиенте
Процедура ИсключитьПлатежиВыполнить()
	Для Каждого СтрокаТаблицы Из СотрудникиИзВедомость Цикл
		СтрокаТаблицы.Выбран = Ложь
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	МассивВозврата = ПолучитьМассив();
	Закрыть(МассивВозврата);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассив()	
	МассивВозврата = Новый Массив();
	СтруктураОтбора = Новый Структура("Выбран", Истина);
	МассивСтрок = СотрудникиИзВедомость.НайтиСтроки(СтруктураОтбора);
	Для каждого СтрМассивСтрок Из МассивСтрок Цикл
		//Паганини ПФ_ Добавил 3 колонки
		//СтруктураВозврата = Новый Структура("Ведомость,Сотрудник,СуммаПлатежа,НДФЛПлатежа");
		//СтруктураВозврата = Новый Структура("Ведомость,Сотрудник,СуммаПлатежа,НДФЛПлатежа");
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
		Если УчетПоПроектам Тогда
			СтруктураВозврата = Новый Структура("Ведомость,Сотрудник,Проект,СуммаПлатежа,НДФЛПлатежа,СуммаПФПлатежа,ВидУдержанияНДФЛ,ВидУдержанияПФ,СуммаЛьгот");
		Иначе
		//ПодольскийАИ #УчетПроектов 25.11.2020 {
			СтруктураВозврата = Новый Структура("Ведомость,Сотрудник,СуммаПлатежа,НДФЛПлатежа,СуммаПФПлатежа,ВидУдержанияНДФЛ,ВидУдержанияПФ,СуммаЛьгот");
		КонецЕсли;
		//_Паганини ПФ
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,СтрМассивСтрок);
		МассивВозврата.Добавить(СтруктураВозврата);
	КонецЦикла; 
	
	Возврат МассивВозврата;	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеФормы(Команда)
	ОбновитьДанныеФормыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормыНаСервере()
	СотрудникиИзВедомость.Очистить();
	ЗаполнитьДанныеФормы();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиИзВедомостиСуммаПлатежаПриИзменении(Элемент)
	СтрСотрудникиИзВедомость = Элементы.СотрудникиИзВедомости.ТекущиеДанные;
	Если СтрСотрудникиИзВедомость.СуммаПлатежа<=СтрСотрудникиИзВедомость.Сумма Тогда
		//Паганини ПФ_
		//СтрСотрудникиИзВедомость.НДФЛПлатежа = СтрСотрудникиИзВедомость.НДФЛ * СтрСотрудникиИзВедомость.СуммаПлатежа / СтрСотрудникиИзВедомость.Сумма;
	    Коэффициент = СтрСотрудникиИзВедомость.СуммаПлатежа / СтрСотрудникиИзВедомость.Сумма;
		СтрСотрудникиИзВедомость.НДФЛПлатежа	= СтрСотрудникиИзВедомость.НДФЛ * Коэффициент;
		СтрСотрудникиИзВедомость.СуммаПФПлатежа = СтрСотрудникиИзВедомость.ПФ	* Коэффициент;
	Иначе
		СтрСотрудникиИзВедомость.СуммаПлатежа	= СтрСотрудникиИзВедомость.Сумма;
		СтрСотрудникиИзВедомость.НДФЛПлатежа	= СтрСотрудникиИзВедомость.НДФЛ;
		СтрСотрудникиИзВедомость.СуммаПФПлатежа = СтрСотрудникиИзВедомость.ПФ
		//_Паганини ПФ
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ОбновитьДанныеФормыНаСервере();
КонецПроцедуры
